src/cf/InformationRegisters/ПротоколВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПротоколВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОчередьЗаданийДокументооборота</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПротоколВыполненияЗаданий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет в лог
//
// Параметры:
//  Задание - СправочникСсылка.ОчередьЗаданийДокументооборота - ссылка на задание.
//  ТекстДобавки - Строка
//
Процедура ДобавитьВЛог(Задание, ТекстДобавки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ПротоколВыполненияЗаданий");
		ЭлементБлокировки.УстановитьЗначение("Задание", Задание);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
		БлокировкаДанных.Заблокировать();
	
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задание = Задание;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если СтрДлина(МенеджерЗаписи.Протокол) > 32000 Тогда
				МенеджерЗаписи.Протокол = ""; // очистим накопленное
			КонецЕсли;	
			
			МенеджерЗаписи.Протокол = ТекстДобавки + Символы.ВК + МенеджерЗаписи.Протокол; 
		Иначе
			МенеджерЗаписи.Протокол = ТекстДобавки;
		КонецЕсли;
		
		МенеджерЗаписи.Задание = Задание;	 
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;	
	
КонецПроцедуры	

// Получает лог
//
// Параметры:
//  Задание - СправочникСсылка.ОчередьЗаданийДокументооборота - ссылка на задание.
//  
//  Возвращаемое значение - Строка
//
Функция ПрочитатьЛог(Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПротоколВыполненияЗаданий.Протокол
	|ИЗ
	|	РегистрСведений.ПротоколВыполненияЗаданий КАК ПротоколВыполненияЗаданий
	|ГДЕ
	|	ПротоколВыполненияЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Протокол;
	
КонецФункции	

// Удалит запись лога
// 
// Параметры:
//  Задание - СправочникСсылка.ОчередьЗаданийДокументооборота - ссылка на задание.
Процедура УдалитьЛог(Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
